[
  {"name": "Whale Shark", "fact": "Largest fish alive; feeds mostly on plankton despite its massive size."},
  {"name": "Great White Shark", "fact": "Can detect a single drop of blood in 25 gallons of water."},
  {"name": "Tiger Shark", "fact": "Nicknamed the 'garbage can of the sea'—it’ll eat anything, from birds to car plates."},
  {"name": "Hammerhead Shark", "fact": "That head shape gives it nearly 360° vision and superb sensory accuracy."},
  {"name": "Blacktip Reef Shark", "fact": "Named for the black markings on its fins; often seen near shallow coral reefs."},
  {"name": "Nurse Shark", "fact": "Nocturnal bottom dweller that sucks up prey like a vacuum with its strong mouth."},
  {"name": "Basking Shark", "fact": "The second-largest fish in the ocean, but entirely harmless to humans."},
  {"name": "Dogfish Shark", "fact": "Small but fierce; known for pack-hunting tactics unusual for sharks."},
  {"name": "Cookiecutter Shark", "fact": "Takes perfectly round 'cookie' bites out of whales, dolphins, and submarines."},
  {"name": "Goblin Shark", "fact": "A deep-sea predator with a jaw that shoots forward like a spring-loaded trap."},
  {"name": "Sawshark", "fact": "Has a chainsaw-like snout lined with sharp teeth used to slash through schools of fish."},
  {"name": "Horn Shark", "fact": "Has blunt horns on its head and crushes shellfish with its powerful jaws."},
  {"name": "Blue Whale", "fact": "The largest animal to ever exist—its tongue alone can weigh as much as an elephant."},
  {"name": "Humpback Whale", "fact": "Their haunting songs travel for hundreds of miles through the ocean."},
  {"name": "Orca", "fact": "Apex predators with family pods that each have their own language and hunting techniques."},
  {"name": "Sperm Whale", "fact": "Has the largest brain of any animal and can dive over 3,000 feet deep for over an hour."},
  {"name": "Beluga", "fact": "Nicknamed the 'canary of the sea' for their playful and musical vocalizations."},
  {"name": "Narwhal", "fact": "Their tusk is actually a giant sensory tooth that can detect changes in water pressure and temperature."},
  {"name": "Bottlenose Dolphin", "fact": "One of the smartest animals on Earth—uses tools, names, and even jokes to communicate."},
  {"name": "Indo-Pacific Humpbacked Dolphin", "fact": "Born gray but turns pink as it matures; thrives in coastal tropical waters."},
  {"name": "Pacific White-Sided Dolphin", "fact": "Known as the 'smiling dolphin' for its permanent grin and playful leaps."},
  {"name": "Vaquita", "fact": "The world’s rarest marine mammal—fewer than 10 remain in the wild."},
  {"name": "Flamboyant Cuttlefish", "fact": "Walks across the seafloor flashing psychedelic colors to warn predators it’s toxic."},
  {"name": "Giant Cuttlefish", "fact": "Males put on stunning color displays to impress mates or fool rivals."},
  {"name": "Blue-ringed Octopus", "fact": "Tiny but deadly—its venom can kill 26 humans within minutes, and there’s no known antidote."},
  {"name": "Giant Pacific Octopus", "fact": "Can open jars, recognize humans, and grow larger than a full-grown human male."},
  {"name": "Dumbo Octopus", "fact": "Named for its ear-like fins; lives deeper than any other known octopus species."},
  {"name": "Blanket Octopus", "fact": "Females can be six feet long while males stay the size of a walnut—one of the ocean’s wildest gender gaps."},
  {"name": "Mimic Octopus", "fact": "Can impersonate over 15 other sea creatures, including lionfish, sea snakes, and flatfish."},
  {"name": "Giant Squid", "fact": "Possesses eyes the size of dinner plates; long believed to be the origin of kraken myths."},
  {"name": "Giant Oarfish", "fact": "Longest bony fish on Earth; its sightings near shore often spark earthquake legends in Japan."},
  {"name": "Sunfish", "fact": "Can weigh over two tons but mostly just floats near the surface like a lazy solar panel."},
  {"name": "Lanternfish", "fact": "One of the most abundant vertebrates on Earth; lights up the ocean with bioluminescent photophores."},
  {"name": "Anglerfish", "fact": "Females have glowing lures and tiny parasitic males that fuse into their bodies permanently."},
  {"name": "Footballfish", "fact": "Another anglerfish cousin—its glowing lure can dangle up to a third of its body length."},
  {"name": "Psychedelic Frogfish", "fact": "Crawls instead of swims, patterned like coral, and changes color faster than a mood ring."},
  {"name": "Hairy Frogfish", "fact": "Covers itself in whisker-like spines and uses a lure on its head to ambush prey."},
  {"name": "Barreleye", "fact": "Has a transparent head and rotating tubular eyes that can look straight up through its own skull."},
  {"name": "Mantis Shrimp", "fact": "Punches faster than a bullet, shattering glass and stunning prey with shockwaves."},
  {"name": "False Cleanerfish", "fact": "Pretends to clean other fish—then bites off their scales and mucus."},
  {"name": "Lobster", "fact": "Can live for over 100 years and actually grows stronger with age thanks to its regenerative molting."},
  {"name": "Snipe Eel", "fact": "Has a beak-like mouth that can’t fully close, but it uses it to snag tiny shrimp in midwater."},
  {"name": "Moray Eel", "fact": "Has a second set of jaws in its throat that shoots forward to grab prey like a sci-fi monster."},
  {"name": "Ribbon Eel", "fact": "Starts life male, turns female later; its vibrant blue and yellow body looks like an underwater ribbon."},
  {"name": "Sea Slug", "fact": "Some species can photosynthesize by stealing chloroplasts from the algae they eat."},
  {"name": "Sea Pig", "fact": "A walking sea cucumber that lives in deep-sea mud and hoovers up decaying whale goo."},
  {"name": "Sea Bunny", "fact": "Tiny and fuzzy-looking sea slug that resembles a rabbit—adorable but mildly toxic."},
  {"name": "Immortal Jellyfish", "fact": "Can revert to its juvenile form after adulthood, making it biologically immortal (the Benjamin Button of the sea)."},
  {"name": "Moon Jellyfish", "fact": "Translucent and hypnotic—moves by pulsing gently through the current like a living lava lamp."},
  {"name": "Egg-Yolk Jellyfish", "fact": "Bright yellow center looks like a sunny-side-up egg; tentacles can reach 20 feet long."},
  {"name": "Portuguese Man o' War", "fact": "Not one animal, but a colony of organisms working together to sting everything in sight."},
  {"name": "Pacific Sea Nettle", "fact": "Drifts in massive jellyfish blooms; its sting can feel like touching a live wire."},
  {"name": "Sea Cucumber", "fact": "When threatened, it can eject its own organs to distract predators and later regrow them."},
  {"name": "Giant Isopod", "fact": "Deep-sea relative of the pill bug; looks like a huge armored roach but just wants to nap forever."},
  {"name": "Leatherback Sea Turtle", "fact": "Largest turtle on Earth—can dive deeper than 4,000 feet and migrate thousands of miles."},
  {"name": "Manta Ray", "fact": "Graceful ocean gliders that often perform somersaults while feeding on plankton."},
  {"name": "Cownose Ray", "fact": "Moves in massive migrating schools; named for its cute, cow-shaped snout."},
  {"name": "Sawfish", "fact": "Endangered species with a saw-like snout used for hunting and defense."},
  {"name": "Skate", "fact": "Flat-bodied relatives of rays with rougher skin and egg cases known as 'mermaid’s purses'."},
  {"name": "California Sea Lion", "fact": "Smart, playful, and loud—known for surfing waves and stealing fish from docks."},
  {"name": "Harbor Seal", "fact": "Quiet, curious sea dogs that can sleep underwater for up to 30 minutes."},
  {"name": "Elephant Seal", "fact": "Huge blubbery brawlers that fight each other for dominance with roaring duels."},
  {"name": "Swordfish", "fact": "Uses its long bill to slash through schools of fish at high speeds."},
  {"name": "Clownfish", "fact": "Lives in anemones for protection and keeps them clean—teamwork at its cutest."},
  {"name": "Horseshoe Crab", "fact": "Older than dinosaurs; its blue blood is used in medical testing to detect bacterial contamination."},
  {"name": "Hermit Crab", "fact": "Lives inside discarded shells; will fight or barter for a better one when it outgrows the old."},
  {"name": "Japanese Spider Crab", "fact": "Largest arthropod on Earth with legs spanning up to 12 feet."},
  {"name": "Seahorse", "fact": "Males carry and give birth to the babies—take that, patriarchy."},
  {"name": "Giant Clam", "fact": "Can weigh over 500 pounds and live more than a century, filtering plankton from coral reefs."},
  {"name": "Yeti Crab", "fact": "Discovered near hydrothermal vents—covered in silky white hair it uses to farm bacteria for food."},
  {"name": "Goblin Shark", "fact": "Sometimes called a living fossil—its jaw launches forward like a monster movie jump-scare."},
  {"name": "Tripod Fish", "fact": "Balances on long fins like stilts on the seafloor, facing into the current waiting for food to drift by."},
  {"name": "Zombie Worm", "fact": "Lives off the bones of dead whales using symbiotic bacteria to digest fat and marrow."},
  {"name": "Black Dragonfish", "fact": "A deep-sea predator that glows red—a color most fish can’t even see."},
  {"name": "Vampire Squid", "fact": "Lives where almost nothing else can, fluttering its cloak-like webbing in pitch darkness."},
  {"name": "Pelican Eel", "fact": "Has a massive expandable mouth shaped like a pelican’s beak that can engulf prey its own size."},
  {"name": "Stargazer Fish", "fact": "Buries itself in sand with only its eyes and mouth showing—then ambushes prey from below."},
  {"name": "Fangtooth Fish", "fact": "Has the largest teeth-to-body ratio of any fish in the ocean and a permanent scowl."},
  {"name": "Gulper Eel", "fact": "Its balloon-like mouth can stretch wide enough to swallow creatures larger than itself."},
  {"name": "Firefly Squid", "fact": "Small but spectacular—thousands light up Japan’s Toyama Bay each year in glowing blue waves."},
  {"name": "Hydrothermal Vent Snail", "fact": "Builds an iron sulfide shell that makes it one of the only animals with armor made of metal."},
  {"name": "Dumbo Octopus", "fact": "Flaps ear-like fins to hover through the deep like a tiny ghost elephant."},
  {"name": "Pink See-Through Fantasia", "fact": "A transparent sea cucumber that glows pink and reveals its organs while drifting midwater."},
  {"name": "Sea Spider", "fact": "Not actually a spider, but close enough to be nightmare fuel—it pumps blood with its legs instead of a heart."},
  {"name": "Giant Tube Worm", "fact": "Thrives in boiling vent water with no mouth or stomach—relies entirely on symbiotic bacteria for survival."},
  {"name": "Axolotl", "fact": "A salamander that never grows up—stays in its larval stage forever and can regrow its limbs, spine, and even parts of its brain."},
  {"name": "Coelacanth", "fact": "Thought extinct for 65 million years until a fisherman caught one in 1938—proof that time travel is real and scaly."},
  {"name": "Mimic Seahorse", "fact": "A tiny master of disguise that mirrors coral textures so perfectly it’s nearly invisible."},
  {"name": "Pistol Shrimp", "fact": "Snaps its claw so fast it creates a bubble that hits 200 decibels and momentarily reaches the temperature of the sun."},
  {"name": "Leaf Sheep", "fact": "A sea slug that looks like a tiny cartoon sheep and literally photosynthesizes sunlight to live."},
  {"name": "Bobbit Worm", "fact": "An ambush predator that can grow 10 feet long, slicing fish in half with jaws faster than a mousetrap."},
  {"name": "Glaucus Atlanticus (Blue Dragon)", "fact": "A blue sea slug that drifts upside down on the ocean’s surface and steals venom from the Portuguese Man o’ War."},
  {"name": "Sailfish", "fact": "Hunts in coordinated packs, flashing its sail-like dorsal fin to confuse prey while sprinting 68 mph underwater."},
  {"name": "Sarcastic Fringehead", "fact": "Defends its burrow by pressing its massive colorful mouth against intruders like a deranged kiss."},
  {"name": "Sea Angel", "fact": "A transparent, winged snail that flaps through polar waters like a glass butterfly—hauntingly beautiful."},
  {"name": "Box Jellyfish", "fact": "One of the most venomous creatures on Earth; its sting can cause heart failure in under five minutes."},
  {"name": "Stonefish", "fact": "Blends in perfectly with rocks and has venomous spines capable of killing a human in hours."},
  {"name": "Cone Snail", "fact": "Pretty, patterned, and extremely deadly—it harpoons prey with a venomous tooth called a radula."},
  {"name": "Greenland Shark", "fact": "Can live over 500 years and swims so slowly it’s basically the ocean’s ancient cryptid grandpa."},
  {"name": "Frilled Shark", "fact": "Primitive species with 300 needle teeth that hasn’t changed in 80 million years—essentially a prehistoric eel."},
  {"name": "Tardigrade", "fact": "Microscopic water bear that survives radiation, boiling water, and space itself—unkillable and unbothered."},
  {"name": "Sea Pen", "fact": "Colonial coral animal shaped like a quill pen that glows with gentle bioluminescence when disturbed."},
  {"name": "Salp", "fact": "Gelatinous barrel creature that drifts in chains and filters carbon, quietly helping regulate Earth’s climate."},
  {"name": "Crown-of-Thorns Starfish", "fact": "Massive spiny starfish that feeds on coral; outbreaks can devastate reefs but are part of natural cycles."},
  {"name": "Feather Star", "fact": "Looks like a floating flower but is actually an ancient echinoderm that swims by waving feathery arms."},
  {"name": "Lion’s Mane Jellyfish", "fact": "Largest jellyfish in the world—tentacles can stretch over 100 feet long, rivaling blue whales in size."},
  {"name": "Ghost Pipefish", "fact": "Transparent and delicate; hovers upside down in seagrass pretending to be part of the plant."},
  {"name": "Sea Walnut", "fact": "A comb jelly that sparkles with rainbow light when it moves—basically an underwater rave organism."},
  {"name": "Pangolin Shark (Chlamydoselachus angustidens)", "fact": "A rarely-seen relic of evolution with overlapping armor-like scales and a mouth full of hook teeth."},
  {"name": "Sea Toad (Coffinfish)", "fact": "Pouts adorably while lurking on the seafloor and can inflate itself into a round pink balloon when threatened."},
  {"name": "Colossal Squid", "fact": "Bigger, thicker, and heavier than the giant squid—with hooks on its tentacles instead of suckers."},
  {"name": "Glass Octopus", "fact": "Almost completely transparent except for its eyes and digestive organs—like a floating ghost."},
  {"name": "Deep-Sea Hatchetfish", "fact": "Has mirror-plated sides that reflect light, rendering it nearly invisible in the water column."},
  {"name": "Ribbon Worm", "fact": "Shoots out a long, sticky proboscis that looks like a glowing lasso to catch prey."},
  {"name": "Sea Urchin", "fact": "Spiny ecosystem engineers that graze on algae and can live for centuries."},
  {"name": "Archerfish", "fact": "Spits jets of water to knock insects out of the air—adjusts for refraction like a built-in physicist."}
]
